In [1]:
#Bibek Shiwakoti
#c0898100
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('example.db')

In [3]:
cursor =conn.cursor()

In [4]:
sql = '''CREATE TABLE EMPLOYEE(
        FIRST_NAME  CHAR(20) NOT NULL,
        LAST_NAME CHAR(20),
        AGE INT NOT NULL,
        SEX CHAR(1),
        INCOME FLOAT
    )'''

In [5]:
    cursor.execute(sql)

OperationalError: table EMPLOYEE already exists

In [6]:
conn.commit()

In [7]:
cursor.execute('''insert into employee(
FIRST_NAME,LAST_NAME,AGE,SEX,INCOME)
VALUES ('RAMYA','RAMA PRIYA',27,'F',9000)
''')

In [8]:
cursor.execute('''insert into employee(
FIRST_NAME,LAST_NAME,AGE,SEX,INCOME)
VALUES ('BIBEK','SHIWAKOTI',28,'M',85000)
''')

In [9]:
cursor.execute('''insert into employee(
FIRST_NAME,LAST_NAME,AGE,SEX,INCOME)
VALUES ('PRAJINA','RAJKARNIKAR',25,'F',92000)
''')

In [10]:
cursor.execute('''insert into employee(
FIRST_NAME,LAST_NAME,AGE,SEX,INCOME)
VALUES ('UMESH','KHATIWADA',24,'M',92000)
''')

In [11]:
cursor.execute('''insert into employee(
FIRST_NAME,LAST_NAME,AGE,SEX,INCOME)
VALUES ('SUJAN','SHRESTHA',27,'M',90000)
''')

In [12]:
cursor.execute('''insert into employee(
FIRST_NAME,LAST_NAME,AGE,SEX,INCOME)
VALUES ('SANDIP','POUDEL',29,'M',80000)
''')

In [13]:
#q HOW CAN WE INSERT ALL ENTRIES IN ONE SINGLE STEP EXPLORE IT
# WE CAN USE EXECUTE_MANY TO INSERT VALUES IN BULK

In [14]:
cursor.execute('''select * from EMPLOYEE''')
#select FIRST_NAME,LAST_NAME,AGE,SEX,INCOME from employee;

In [15]:
result =cursor.fetchone()
print(result)

('RAMYA', 'RAMA PRIYA', 27, 'F', 9000.0)

In [16]:
result =cursor.fetchmany(2)
print(result)

[('BIBEK', 'SHIWAKOTI', 28, 'M', 85000.0), ('PRAJINA', 'RAJKARNIKAR', 25, 'F', 92000.0)]

In [17]:
result = cursor.fetchall();

In [18]:
print(result)

[('UMESH', 'KHATIWADA', 24, 'M', 92000.0), ('SUJAN', 'SHRESTHA', 27, 'M', 90000.0), ('SANDIP', 'POUDEL', 29, 'M', 80000.0)]

In [19]:
df=pd.read_sql_query('select * from employee',
                    conn)

In [20]:
df

  FIRST_NAME    LAST_NAME  AGE SEX   INCOME
0      RAMYA   RAMA PRIYA   27   F   9000.0
1      BIBEK    SHIWAKOTI   28   M  85000.0
2    PRAJINA  RAJKARNIKAR   25   F  92000.0
3      UMESH    KHATIWADA   24   M  92000.0
4      SUJAN     SHRESTHA   27   M  90000.0
5     SANDIP       POUDEL   29   M  80000.0

In [21]:
sql = '''update EMPLOYEE set AGE = AGE+1 where SEX='M' '''
cursor.execute(sql)

In [22]:
df=pd.read_sql_query('select * from employee',
                    conn)

In [23]:
df

  FIRST_NAME    LAST_NAME  AGE SEX   INCOME
0      RAMYA   RAMA PRIYA   27   F   9000.0
1      BIBEK    SHIWAKOTI   29   M  85000.0
2    PRAJINA  RAJKARNIKAR   25   F  92000.0
3      UMESH    KHATIWADA   25   M  92000.0
4      SUJAN     SHRESTHA   28   M  90000.0
5     SANDIP       POUDEL   30   M  80000.0

In [24]:
sql ='''ALTER TABLE EMPLOYEE
RENAME COLUMN SEX TO GENDER''';

In [25]:
cursor.execute(sql)

In [26]:
df=pd.read_sql_query('select * from employee',
                    conn)

In [27]:
df

  FIRST_NAME    LAST_NAME  AGE GENDER   INCOME
0      RAMYA   RAMA PRIYA   27      F   9000.0
1      BIBEK    SHIWAKOTI   29      M  85000.0
2    PRAJINA  RAJKARNIKAR   25      F  92000.0
3      UMESH    KHATIWADA   25      M  92000.0
4      SUJAN     SHRESTHA   28      M  90000.0
5     SANDIP       POUDEL   30      M  80000.0

In [28]:
# rename table
sql ='''ALTER TABLE EMPLOYEE
RENAME TO STAFF''';

In [29]:
cursor.execute(sql)

In [30]:
df=pd.read_sql_query('select * from staff',
                    conn)

In [31]:
df

  FIRST_NAME    LAST_NAME  AGE GENDER   INCOME
0      RAMYA   RAMA PRIYA   27      F   9000.0
1      BIBEK    SHIWAKOTI   29      M  85000.0
2    PRAJINA  RAJKARNIKAR   25      F  92000.0
3      UMESH    KHATIWADA   25      M  92000.0
4      SUJAN     SHRESTHA   28      M  90000.0
5     SANDIP       POUDEL   30      M  80000.0

In [32]:
sql ='''delete  from staff where age>=29''';

In [33]:
cursor.execute(sql)

In [34]:
df=pd.read_sql_query('select * from staff',
                    conn)

In [35]:
df

  FIRST_NAME    LAST_NAME  AGE GENDER   INCOME
0      RAMYA   RAMA PRIYA   27      F   9000.0
1    PRAJINA  RAJKARNIKAR   25      F  92000.0
2      UMESH    KHATIWADA   25      M  92000.0
3      SUJAN     SHRESTHA   28      M  90000.0

In [36]:
sql ='''drop  table staff ''';
cursor.execute(sql)

In [37]:
df=pd.read_sql_query('select * from staff',
                    conn)
#error shows that database is deleated already

DatabaseError: Execution failed on sql 'select * from staff': no such table: staff